app/controllers/answers_controller.rb

  def create
    question =  Question.find_by(id: params[:question_id])
    answer = question.answers.build(answer_params)
    answer.user_id = current_user.id
    if
      answer.save
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "answers" ("input", "user_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["input", "Yes"], ["user_id", 1], ["question_id", 20], ["created_at", 2016-11-29 22:19:02 UTC], ["updated_at", 2016-11-29 22:19:02 UTC]]