app/controllers/groups_controller.rb

    def index
        groups = Group.all
---
SELECT "groups".* FROM "groups"

    def create
        group = Group.create(group_params)
---
INSERT INTO "groups" ("groupname", "created_at", "updated_at") VALUES (?, ?, ?)  [["groupname", "test group 4"], ["created_at", 2016-11-28 19:24:16 UTC], ["updated_at", 2016-11-28 19:24:16 UTC]]

    def createMembership
        #binding.pry
        #userId = params["user_id"]
        user = current_user
        group = Group.find_by_id(params[:group_id])
        group.memberships.build(:user_id => user.id, :group_id => params["group_id"]).save
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
INSERT INTO "memberships" ("user_id", "group_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["group_id", 8], ["created_at", 2016-11-29 23:19:47 UTC], ["updated_at", 2016-11-29 23:19:47 UTC]]

    def show
        group = Group.find_by_id(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def my_groups
        #binding.pry
        user = current_user
        #current_user = User.find_by(id: 1)
        userGroups = user.groups
---
SELECT "groups".* FROM "groups" INNER JOIN "memberships" ON "groups"."id" = "memberships"."group_id" WHERE "memberships"."user_id" = ?  [["user_id", 1]]