app/controllers/questions_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
    def create
        #raise params.inspect
        @question = current_user.asked_questions.build(question_params)
        @group = Group.find_by(:id => params[:question][:group_id])