app/controllers/questions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def create
       #raise params.inspect
        user = User.find_by_id(params[:user_id])