app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions"
---
    def index
        questions = Question.all

SELECT "groups".* FROM "groups" INNER JOIN "group_questions" ON "groups"."id" = "group_questions"."group_id" WHERE "group_questions"."question_id" = ?  [["question_id", 1]]
SELECT "group_questions".* FROM "group_questions" WHERE "group_questions"."group_id" = ?  [["group_id", 1]]
---
    def my_questions
        #binding.pry
        user = current_user
        #user = User.find_by(id: 1)
        myQuestions = []
        userQuestions = user.groups.each do |group|
            group.group_questions.each do |groupQuestion|

SELECT "questions".* FROM "questions" INNER JOIN "answers" ON "questions"."id" = "answers"."question_id" WHERE "answers"."user_id" = ?  [["user_id", 1]]
---
    def my_asked_questions
        #binding.pry
        user = current_user
        #current_user = User.find_by(id: 1)
        myAskedQuestions = []
        userAskedQuestions =
            user.questions.each do |question|

INSERT INTO "questions" ("query", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["query", "is this a test of front end ng question creation"], ["user_id", 1], ["created_at", 2016-11-29 16:45:17 UTC], ["updated_at", 2016-11-29 16:45:17 UTC]]
INSERT INTO "group_questions" ("group_id", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 7], ["question_id", 7], ["created_at", 2016-11-29 17:02:36 UTC], ["updated_at", 2016-11-29 17:02:36 UTC]]
---
    def create
       #raise params.inspect
        #user = User.find_by_id(params[:user_id])
        user = current_user
       question = user.asked_questions.build(question_params)
       #group = Group.find_by(:id => params[:group_id])
        if
            question.save
                groupArray = params["groups"]
                groupArray.each { |id|

                #binding.pry
                    groupid = id
                    #group = Group.find_by(id: groupid)
                    GroupQuestion.create(group_id: groupid, question_id: question.id )

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        question = Question.find(params[:id])